teaching/game_theory/slides/strategic_moves.org
#+OPTIONS: toc:nil num:nil 
 
#+startup: beamer 
#+LaTeX_CLASS: beamer 
#+latex_class_options: [10pt] 
#+beamer_theme: Boadilla 
#+beamer_header: \usecolortheme{seagull} 
#+beamer_header: \usefonttheme[onlylarge]{structurebold} 
#+beamer_header: \usefonttheme[onlymath]{serif} 
#+beamer_header: \setbeamerfont*{frametitle}{size=\normalsize,series=\bfseries} 
#+beamer_header: \setbeamertemplate{navigation symbols}{} 
#+beamer_header: \setbeamertemplate{itemize item}[triangle] 
#+beamer_header: \setbeamertemplate{footline}{} 
#+beamer_header: \setbeamertemplate{enumerate items}[default] 

#+TITLE: Strategic Moves
#+AUTHOR: ECON 420: Game Theory
#+DATE: Spring 2018 

* 
*Cheap Talk*
- Players may attempt to communicate their intentions before the game begins
- This adds a new first-stage to the game
- Communication may be /credible/ or /non-credible/

* 
*Strategic Moves*
- Any action that changes the rules of the game is a strategic move
  - Adding stages, changing payoffs, adding/removing choices
- Examples: Commitments, threats, promises 
- The goal of a strategic move is to alter subsequent stages to the advantage of a player
- Strategic moves must be /observable/ and /irreversible/

* 
*Unconditional strategic moves*
- Sometimes useful for players to /commit/ to a certain strategy 
  - "Whatever you choose, I am going to do /X/"
- Creates a first-mover advantage for the player
- Example: Extra-credit game (splitting points)

* 
*Conditional strategic moves*
- Players may create /response rules/
  - "If you do /X/, I'll do /Y/"
- Player may be trying to /deter/ or /compel/ the other player to do something 
- Players may /threaten/ certain behavior
  - "If you do /X/, I'll do /Y/ which will hurt you"
  - "No dessert if you don't finish your broccoli"
- Players may /promise/ certain behavior
  - "If you do /X/, I'll promise to do /Z/, which will make you better off"
  - "Santa will bring you presents if you're good"

* 
*Credibility*
- Threats must be costly for the player to carry out
  - Payoff is lower if the player follows through with a threat
  - Nobody wants to prevent their child from eating dessert
- To be credible, all players must remove that the high-payoff options will be removed from the game if the desired action is not taken
- Example: Doomsday device from Dr. Strangelove

* Commitment example: Chicken

* 
*Commitment* 
- The rollback equilibrium is dependent on the credibility of the commitment
- How can a player credibly commit in the game of chicken?

* Threats example: Trade

* 
*Dominance and threats*
- China has a dominant strategy in the trade game (closed)
- But if the US can credibly threaten to close if China closes, then China plays their /dominated/ strategy at equilibrium
  - Game rules have changed, strategies from original game not complete

* Promise example: Restaurant pricing

* 
*Credibility*
- Strategic moves are /observable/ and /irreversible/
- But in all situations, the first-mover has an incentive to change their minds in the second stage
- Credibility requires reputation, or some commitment device

* Promises and Threats
