teaching/game_theory/slides/strategic_moves.tex
% Created 2018-05-23 Wed 07:22
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{Boadilla}
\author{ECON 420: Game Theory}
\date{Spring 2018}
\title{Strategic Moves}
\usecolortheme{seagull}
\usefonttheme[onlylarge]{structurebold}
\usefonttheme[onlymath]{serif}
\setbeamerfont*{frametitle}{size=\normalsize,series=\bfseries}
\setbeamertemplate{navigation symbols}{}
\setbeamertemplate{itemize item}[triangle]
\setbeamertemplate{footline}{}
\setbeamertemplate{enumerate items}[default]
\hypersetup{
 pdfauthor={ECON 420: Game Theory},
 pdftitle={Strategic Moves},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\begin{frame}[label={sec:orgeb23bfc}]{}
\alert{Cheap Talk}
\begin{itemize}
\item Players may attempt to communicate their intentions before the game begins
\item This adds a new first-stage to the game
\item Communication may be \emph{credible} or \emph{non-credible}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgcbc2439}]{}
\alert{Strategic Moves}
\begin{itemize}
\item Any action that changes the rules of the game is a strategic move
\begin{itemize}
\item Adding stages, changing payoffs, adding/removing choices
\end{itemize}
\item Examples: Commitments, threats, promises
\item The goal of a strategic move is to alter subsequent stages to the advantage of a player
\item Strategic moves must be \emph{observable} and \emph{irreversible}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org3a814a1}]{}
\alert{Unconditional strategic moves}
\begin{itemize}
\item Sometimes useful for players to \emph{commit} to a certain strategy 
\begin{itemize}
\item "Whatever you choose, I am going to do \emph{X}"
\end{itemize}
\item Creates a first-mover advantage for the player
\item Example: Extra-credit game (splitting points)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org9ca6235}]{}
\alert{Conditional strategic moves}
\begin{itemize}
\item Players may create \emph{response rules}
\begin{itemize}
\item "If you do \emph{X}, I'll do \emph{Y}"
\end{itemize}
\item Player may be trying to \emph{deter} or \emph{compel} the other player to do something
\item Players may \emph{threaten} certain behavior
\begin{itemize}
\item "If you do \emph{X}, I'll do \emph{Y} which will hurt you"
\item "No dessert if you don't finish your broccoli"
\end{itemize}
\item Players may \emph{promise} certain behavior
\begin{itemize}
\item "If you do \emph{X}, I'll promise to do \emph{Z}, which will make you better off"
\item "Santa will bring you presents if you're good"
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgd4fb32f}]{}
\alert{Credibility}
\begin{itemize}
\item Threats must be costly for the player to carry out
\begin{itemize}
\item Payoff is lower if the player follows through with a threat
\item Nobody wants to prevent their child from eating dessert
\end{itemize}
\item To be credible, all players must remove that the high-payoff options will be removed from the game if the desired action is not taken
\item Example: Doomsday device from Dr. Strangelove
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org63d0e9c}]{Commitment example: Chicken}
\end{frame}

\begin{frame}[label={sec:org24c39ca}]{}
\alert{Commitment} 
\begin{itemize}
\item The rollback equilibrium is dependent on the credibility of the commitment
\item How can a player credibly commit in the game of chicken?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4deec37}]{Threats example: Trade}
\end{frame}

\begin{frame}[label={sec:orgead16af}]{}
\alert{Dominance and threats}
\begin{itemize}
\item China has a dominant strategy in the trade game (closed)
\item But if the US can credibly threaten to close if China closes, then China plays their \emph{dominated} strategy at equilibrium
\begin{itemize}
\item Game rules have changed, strategies from original game not complete
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb8302c1}]{Promise example: Restaurant pricing}
\end{frame}

\begin{frame}[label={sec:org8a8ce64}]{}
\alert{Credibility}
\begin{itemize}
\item Strategic moves are \emph{observable} and \emph{irreversible}
\item But in all situations, the first-mover has an incentive to change their minds in the second stage
\item Credibility requires reputation, or some commitment device
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga1f5e6a}]{Promises and Threats}
\end{frame}
\end{document}